content/posts/20220712-bash-ue.org
#+TITLE: A Template C++ Unreal Engine project
#+DATE: <2022-07-12>
#+OPTIONS: ^:nil

The normal methodology of working on a UE C++ project is through visual studio. I found it a very unpleasant
dev workflow, so I created an easy to use template c++ project with some helper scripts that include a bash script
which you use to open, run or compile a Unreal engine.

Project code is available [[https://github.com/lafith/UE5Template][here]]

I followed [[https://www.youtube.com/watch?v=94FvzO1HVzY][Alex Forsythe]]'s video on the fundamentals of an unreal engine C++ project to create this template.

1. A skeletal UE C++ project.
2. A Python script to rename all necessary files to your preferred name.
3. =python3 rename_project.py --name [proj_name]=
4. A Batch file with all necessary commands for editing, playing, building and shipping UE project.
#+begin_src sh
./ue.bat build         Compile the modules
./ue.bat editor        Open the project in the UE5 Editor
./ue.bat run           Run a playable instance of the game
./ue.bat buildexe      Build the standalone game
./ue.bat ship          Cook and Build the standalone game for shipping
#+end_src


