posts/20220712-bash-ue.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>A Template C++ Unreal Engine project</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
<link rel="stylesheet" type="text/css" href="/orgstyle.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Roboto+Slab&display=swap" rel="stylesheet">
<link rel="icon" href="spock-favicon.png" type="image/png">
</head>
<body>
<div id="preamble" class="status">
<hr style="border-top: 1px solid black;">
<div class='topnav' style='display: flex; justify-content: space-between; align-items: center;'>
  <a href="/index.html"><h2 style='margin-top: 0; margin-bottom: 0; margin-left:0px;'>Lafith Mattara</h2></a>
  <div class='topnav2' style='color:#cfcaca;'>
    <a href='/archive.html' style='font-weight:bold; font-style:italic;'>Blog </a> / 
    <a href='/about.html' style='font-weight:bold; font-style:italic;'>About Me </a> /
  </div>
</div>
<hr style="border-top: 1px solid black;">
</div>
<div id="content">
<header>
<h1 class="title">A Template C++ Unreal Engine project</h1>
</header><p>
The normal methodology of working on a UE C++ project is through visual studio. I found it a very unpleasant
dev workflow, so I created an easy to use template c++ project with some helper scripts that include a bash script
which you use to open, run or compile a Unreal engine.
</p>

<p>
Project code is available <a href="https://github.com/lafith/UE5Template">here</a>
</p>

<p>
I followed <a href="https://www.youtube.com/watch?v=94FvzO1HVzY">Alex Forsythe</a>'s video on the fundamentals of an unreal engine C++ project to create this template.
</p>

<ol class="org-ol">
<li>A skeletal UE C++ project.</li>
<li>A Python script to rename all necessary files to your preferred name.</li>
<li><code>python3 rename_project.py --name [proj_name]</code></li>
<li>A Batch file with all necessary commands for editing, playing, building and shipping UE project.</li>
</ol>
<div class="org-src-container">
<pre class="src src-sh">./ue.bat build         Compile the modules
./ue.bat editor        Open the project<span class="org-keyword"> in</span> the UE5 Editor
./ue.bat run           Run a playable instance of the game
./ue.bat buildexe      Build the standalone game
./ue.bat ship          Cook and Build the standalone game for shipping
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-07-12 Tue 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
